ednieuw/Arduino-ESP32-Nano-Wordclock/Old/ESP32_WordClockV201/ESP32_WordClockV201.ino
/* 
 Author      : Ed Nieuwenhuys ednieuw.nl
 Changes V001: Derived from ESP32C3S3_WordClockV026.ino
 Changes V003: Clock and SK6812 LEDstrip working
...
 Changes V094: Replaced NIMBLE with ESP32 BLE
...
 Changes V130: Removed old coding and use NEOPIXEL and use ESPAsyncWebServer. 203222 l/s again instead of 140000
 Changes V131: Added H04 tiny IR-remote
 Changes V132: Cleanup code
 Changes V133: Added in CheckRestoreWIFIconnectivity() Failsafe NoConnectionCounter that restart after 30 minutes no IP when WIFI is On 
 Changes V134: Added in CheckRestoreWIFIconnectivity() Loopcounter<10 and network available. --> Will reboot. Minor typos and cleanups
 Changes V135: Optimized used of CheckRestoreWIFIconnectivity() and check every hour instead of every mniute
 Changes V136: Added Log viewer webpage url/log 
 Changes V137: No use
 Changes V138: Solve restart ESP32 sprintf --> snprintf
 Changes V139: Logviewer -> 500 lines
 Changes V140: Changed wifi case WL_CONNECTED:
 Changes V141: Ringbuffer with String and Free heap is working OK
 Changes V142: Ringbuffer to char** 
 Changes V143: Ringbuffer to char** optimized
 Changes V144: Keeps all logs in PSRAM  Limits /tekstprint to 500 lines for safe browser display  Allows /tekstdownload for full log retrieval
 Changes V145: No log file anymore --> solved while (!Serial && ( (millis()-Tick) < 500)) { delay(50); }
 Changes V146: Works OK
 Changes V147: Line numbers removed and code cleaning in Logviewer.h 
 Changes V148: Replace snprintf(sptext, sizeof(sptext) with Tekstprintf. Added Option Y { and G from web page menu not possible
 Changes V149: Flashing warning text Option Y or G not possible in web page menu. Optimized bool GetNTPtime(bool printit) . Mem.TimeLogPrint used to turn off time printing every minute
               Major cleanup and bugfixes
 Changes V150: Stable version
 Changes V151: functie FILENAAM \ ook voor MacOS/Linux /.  Mem.TimeLogPrint       = 1;    // Print time per minute (1) or hour (2)
 Changes V152: error in 4-L clock solved. Optimized print time /min /hr
 Changes V153: Larger ringbuffer
 Changes V154: Optimizing K0 K1 K2
 Changes V155: No menu print to logging when SWversion is printed to Webpage. Added DoNotLog flag
 Changes V156: Optimize use of DoNotLog flag. const char* PrintRTCTime() --> Tekstprintln(PrintRTCTime()); WTekstprint(PrintRTCTime(), "<!--", " -->");
 Changes V157: testing
 Changes V158: K0 not updating LEDs.-->fixed. added in Everyminute() 
 Changes V159: Double printing of menu in Logging solved. Option K2 solved extra printing
 Changes V160: Stable
 Changes V161 - V173 BLEtimeSender code development Changes V185: Changed name of TimeSender -> TimeReceiver.
 Changes V174: Time sender working 
 Changes V175: ToDo: Make time sender optional with Mem.TimeSender. SendMessageBLE(string -> const char* msg)
 Changes V176: deviceConnected ->  BLEConnected TSConnected
 Changes V178: Ringbuffer 
 Changes V179: Ringbuffer 
 Changes V180: Ringbuffer repaired. BLE time Sender optimized. 
 Changes V181: Testing. Cleanup code
 Changes V182: Make use of timesender selectable
 Changes V183: Stable version
 Changes V184: Print of long logbuffer in chunks to avoid crash as txt download file
 Changes V185: Changed name of TimeSender -> TimeReceiver.
 Changes V186: Simplified: "attachment; filename=\"%s-log.txt\"", Mem.BLEbroadcastName);
 Changes V187: Added CheckWIFIcommand() to avoid WIFI crashes when a command take several seconds to end, like LEDtest()
 Changes V188: Stable
 Changes V189: Added DisconnectBLE() as function. When @ in webpage inputfield cleared from sticking @.
 Changes V190: Variables etc. renamed from Timesender -> Timereceiver in Timereceiver functions   
 Changes V191: In timereceiver Connected to: Mem.BLEbroadcastName and yellow status LED when connected
 Changes V192: Repair 4-language clock display. Renamed Playlights() --> LEDtest(). 
               Q8=RAINBOW resetting ESP32 solved to -> update per minute. After 5 MCU restart in an hout Reset all settings to factory default 
 Changes V193: Refined Mem.MCUrestarted. No ResetCredential. Set counter to 0 between 1 and 2 hours
 Changes V194: Refined logging (NTP update and time send when LEDs turn on/off with n2208) Mem.TimeMinute --> MemTimeLogPrint
 Changes V195: Cleanup code. Comparable with ESP32Arduino_CommV022.ino. Corrected bug ->  Mem.NVRAMmem[lasthour] = NoofLDRreadshour ? (byte)(SumLDRreadshour / NoofLDRreadshour) : 0;
 Changes V196: To avoid translation lang="en" added -> <html lang="en"><head>. Changes in void PrintMem(void) .
 Changes V197: Added menu option V: Background colour not used LEDs (to hide bleeding between LED cells) 
 Changes V198: Viertalenklok Ulrich added  #define VIERTALENKLOK
 Changes V199: All Rework in Webpage to CheckWIFIcommand(). 199a Clock logic in ClockLogic.h. Corrected double Menu i and ii on webpage when BLE open.
               Updated HTML and logging behaviour. Added option V background, Changed LDR reading when background is on, input decimal or hexadecimal, KURZ, EXACT etc bij Ulrich 4-talen weg
               Removed short LDR reading under X LDR_LED. NoTextInLeds in EveryHourUpdate -> end of function 
               lastminute = 99; -> end ReworkInputString .Cleanup code. 
 Changes V200: OTA logic improved
 Changes V201: LED near LDR on/off 
 Changes V202: HET IS WAS of in 4-talen klok

 Issue: Long menu still does not print properly in IOS Timesender app.
*********************
How to compile: 
Install ESP32 boards
Board: ESP32 core version >3.2.0 
Partition Scheme: With FAT
Pin Numbering: By Arduino pin (default)     -- > with EdsoftLED both can be used
               By GPIO number (legacy)      -- > When using NEOpixel
               Adafruit_NeoPixel/esp.c:78:(.text.espShow+0x55): undefined reference to `digitalPinToGPIONumber' when using By Arduino pin
USB mode: Normal (Tiny USB)
**********************

Select below, with only one #define selected, the clock type

*/
// =============================================================================================================================
// ------------------>   Define only one clock type
#define FOURLANGUAGECLOCK       // Four-language clock with 625 LEDs 
//#define NL144CLOCK              // Dutch display for 12 x 12 Front
//#define NL92CLOCK               // Dutch display for one LED behind every character
//#define NLM1M2M3M4L161          // NL EdSoft Qclock design
//#define DE144CLOCK              // German display for 12 x 12 Front
//#define NLM1M2M3M4L94           // NL clock with four extra LEDs for the minutes to light up 
//#define NLM1M2M3M4L114          // NL clock with four extra LEDs for the minutes to light up
//#define NLM1M2M3M4L144          // NL clock with four extra LEDs for the minutes to light up 
//#define NLM1M2M3M4L256          // NL clock with four extra LEDs for the minutes to light up
//#define VIERTALENKLOK           // Viertalenklok Ulrich

